Revit 2027 API
DimensionType.GetSpecTypeId Method
 Gets the spec of this dimension style.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetSpecTypeId()
Public Function GetSpecTypeId As ForgeTypeId
public:
ForgeTypeId^ GetSpecTypeId()
member GetSpecTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
 Identifier of the spec.
Remarks
 The spec will represent either length, angle or slope.
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace